In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('customer_data.csv')

In [3]:
df.head()

,ID,Name,Gender,Age,100Plus,Sprite,Pepsi,Coca-cola,Fanta,Red Bull,Cofee,Tea,Americano,Latte,Capucino
0,3,Jamal,Male,40,4,0,0,3,2,3,9,9,5,7,5
1,4,Henry,Male,32,7,5,3,2,4,9,2,3,0,0,1
2,5,Zoe,Female,41,2,4,0,0,1,2,15,12,8,15,6
3,6,Antony,Male,46,2,2,3,1,5,4,8,9,12,6,9
4,7,Lawrence,Male,55,1,0,0,0,2,3,6,10,13,8,7

In [4]:
attributes = df.iloc[:,4:15].copy()

In [5]:
attributes.head()

,100Plus,Sprite,Pepsi,Coca-cola,Fanta,Red Bull,Cofee,Tea,Americano,Latte,Capucino
0,4,0,0,3,2,3,9,9,5,7,5
1,7,5,3,2,4,9,2,3,0,0,1
2,2,4,0,0,1,2,15,12,8,15,6
3,2,2,3,1,5,4,8,9,12,6,9
4,1,0,0,0,2,3,6,10,13,8,7

In [6]:
customers = df.iloc[:,0:4].copy()

In [7]:
customers.head()

   ID      Name  Gender  Age
0   3     Jamal    Male   40
1   4     Henry    Male   32
2   5       Zoe  Female   41
3   6    Antony    Male   46
4   7  Lawrence    Male   55

In [8]:
label = attributes.idxmax(axis=1)

In [9]:
label.head()

0        Cofee
1     Red Bull
2        Cofee
3    Americano
4    Americano
dtype: object

In [10]:
df = customers.merge(label.to_frame(), left_index=True, right_index=True)

In [11]:
df.head()

   ID      Name  Gender  Age          0
0   3     Jamal    Male   40      Cofee
1   4     Henry    Male   32   Red Bull
2   5       Zoe  Female   41      Cofee
3   6    Antony    Male   46  Americano
4   7  Lawrence    Male   55  Americano

In [12]:
df.shape

(1998, 5)

In [13]:
df = df.rename(columns={0:'label'})

In [14]:
df.head()

   ID      Name  Gender  Age      label
0   3     Jamal    Male   40      Cofee
1   4     Henry    Male   32   Red Bull
2   5       Zoe  Female   41      Cofee
3   6    Antony    Male   46  Americano
4   7  Lawrence    Male   55  Americano

In [15]:
df.to_csv('customers_data_final.csv', sep='\t')

In [16]:
df['Gender'].replace(['Female','Male'],[0,1], inplace=True)

In [17]:
import sklearn

In [18]:
from sklearn.model_selection import train_test_split

In [19]:
df.head(15)

    ID       Name  Gender  Age      label
0    3      Jamal       1   40      Cofee
1    4      Henry       1   32   Red Bull
2    5        Zoe       0   41      Cofee
3    6     Antony       1   46  Americano
4    7   Lawrence       1   55  Americano
5    8    Havertz       1   18   Red Bull
6    9     Thomas       1   42  Americano
7   10       Matt       1   22    100Plus
8   11    Frank ?       1   53        Tea
9   12     Raul ?       1   42  Americano
10  13    Gerry ?       1   57      Cofee
11  14    Chong ?       1   41      Cofee
12  15   Arthur ?       1   41        Tea
13  16  Numbers ?       1   46      Cofee
14  17   Rickey ?       1   52        Tea

In [20]:
training_data = df.iloc[:,2:5]

In [21]:
X = training_data[['Gender','Age']].to_numpy()

In [22]:
X.shape

(1998, 2)

In [23]:
Y = training_data['label'].to_numpy()

In [24]:
Y = Y.flatten()

In [25]:
X = X.tolist()

In [26]:
Y = Y.tolist()

In [58]:
X = np.array(X)

NameError: name 'np' is not defined

In [ ]:
Y = np.array(Y)

In [27]:
training_data.head()

   Gender  Age      label
0       1   40      Cofee
1       1   32   Red Bull
2       0   41      Cofee
3       1   46  Americano
4       1   55  Americano

In [33]:
import sklearn.model_selection

In [35]:
from sklearn.model_selection import train_test_split

In [40]:
import sklearn.model_selection

In [41]:
X_train, X_test, y_train, y_test = sklearn.model_selection.train_test_split(X, Y, test_size=0.2)

In [42]:
from sklearn.linear_model import LogisticRegression
model = LogisticRegression()